ERP DEV.WMS/src/DataProcessors/вмс_НастройкиМодуля/вмс_НастройкиМодуля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_НастройкиМодуля</name>
</mdclass:DataProcessor>

ERP DEV.WMS/src/InformationRegisters/вмс_Лицензии/вмс_Лицензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_Лицензии</name>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачалоСеанса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПубличныйКлюч</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_ЛицензииПодсистем/вмс_ЛицензииПодсистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ЛицензииПодсистем</name>
  <resources>
    <name>Отображение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лицензия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подсистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_СоединениеОбъектов/вмс_СоединениеОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_СоединениеОбъектов</name>
  <resources>
    <name>ОсновнойРесурс</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИсточник</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПриемник</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Схема</name>
    <type>
      <types>CatalogRef.вмс_СхемыСоединенияОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение3</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Enums/вмс_ТипыЯчеек/вмс_ТипыЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ТипыЯчеек</name>
  <enumValues>
    <name>ЗонаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтбора</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>ЗонаКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Подпитка</name>
  </enumValues>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиПрограммы/вмс_НастройкиПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиПрограммы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>EnumRef.вмс_ТипыПодключенияКИС</types>
      <types>CatalogRef.вмс_МестаХранения</types>
      <types>Boolean</types>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef.вмс_СпособыУпаковкиДанныхОбмена</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗагружатьИзИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяХранилище</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/DataProcessors/вмс_НастройкиМодуля/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНастройкиМодуля();
	ЗапроситьКоличествоЛицензийТСД();
	ЗапроситьКоличествоЛицензийПодсистем();
	ОбновитьЗаголовокКоличествоЛицензий();
	ПрочитатьНастройкиВесогабариты();
	УстановитьДоступностьЭлементов();
	ПроверкаКомпонентыСетевойПечатиНаСервере();
	
	Если Параметры.Свойство("ОткрытьНастройкиРазмещения") Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.УчетныеНастройки;
		Элементы.ГруппаУчетныхНастроек.ТекущаяСтраница = Элементы.НастройкиВесогабаритов;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)    
	
	Если ИмяСобытия = "Запись_РегламентныеЗадания" Тогда 
		ГуидПодпитки = ПолучитьГуидРегламентногоЗаданияПодпитки(); 
		ГуидТекущегоЗадания = Новый УникальныйИдентификатор(Параметр);
		
		Если ГуидПодпитки = ГуидТекущегоЗадания Тогда   
			Использование = ПолучитьИспользованиеРегламеногоЗаданияПодпитки();
			УстановитьНастройкиПодпитки(Использование);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОтветственноеХранениеПриИзменении(Элемент)
	
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКодыМаркировкиТоваровПриИзменении(Элемент) 
	
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТаруПриИзменении(Элемент)
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
КонецПроцедуры

&НаКлиенте
Процедура ДеморежимПриИзменении(Элемент)
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерПриИзменении(Элемент)
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
КонецПроцедуры

&НаКлиенте
Процедура АдресПубликацииПриИзменении(Элемент)
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
КонецПроцедуры

&НаКлиенте
Процедура АдреслкПриИзменении(Элемент)
	
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторпользователялкПриИзменении(Элемент)
	
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
	
КонецПроцедуры

&НаКлиенте
Процедура СекретпользователялкПриИзменении(Элемент)
	
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьХарактеристикиПриИзменении(Элемент)
	
	УстановитьИспользованиеХарактеристик();
	
КонецПроцедуры 

&НаСервере
Функция УстановитьИспользованиеХарактеристик() 
	
	НастройкаПрограммы = Справочники.вмс_НастройкиПрограммы.ПолучитьНастройкуПрограммы("НастройкаТоварныхПолей");
	СтруктураНастройки = НастройкаПрограммы.ХранилищеНастройки.Получить();
	
	Если СтруктураНастройки = Неопределено Тогда
		СтруктураНастройки = вмс_ОперацииПоЯчейкамКлиентСервер.ПолучитьСтруктуруНастройкиТоварныхПолей();
	КонецЕсли;
	
	СтрокаПоля = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(СтруктураНастройки.ТаблицаПолей, Новый Структура("Имя", "Характеристика"));
	СтрокаПоля.Использование = ИспользоватьХарактеристики; 
	
	ОбъектНастройкаПрограммы = НастройкаПрограммы.ПолучитьОбъект();
	ОбъектНастройкаПрограммы.ХранилищеНастройки = Новый ХранилищеЗначения(СтруктураНастройки, Новый СжатиеДанных(9));
	ОбъектНастройкаПрограммы.Записать();
	
	
КонецФункции

&НаКлиенте
Процедура ИспользоватьСерииПриИзменении(Элемент)
	УстановитьИспользованиеСерий();
	Элементы.ИспользоватьСерии_Настройки.Доступность = ИспользоватьСерии;
КонецПроцедуры 

&НаСервере
Функция УстановитьИспользованиеСерий() 
	
	НастройкаПрограммы = Справочники.вмс_НастройкиПрограммы.ПолучитьНастройкуПрограммы("НастройкаТоварныхПолей");
	СтруктураНастройки = НастройкаПрограммы.ХранилищеНастройки.Получить();
	
	Если СтруктураНастройки = Неопределено Тогда
		СтруктураНастройки = вмс_ОперацииПоЯчейкамКлиентСервер.ПолучитьСтруктуруНастройкиТоварныхПолей();
	КонецЕсли;
	
	СтрокаПоля = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(СтруктураНастройки.ТаблицаПолей, Новый Структура("Имя", "Серия"));
	СтрокаПоля.Использование = ИспользоватьСерии; 
	
	ОбъектНастройкаПрограммы = НастройкаПрограммы.ПолучитьОбъект();
	ОбъектНастройкаПрограммы.ХранилищеНастройки = Новый ХранилищеЗначения(СтруктураНастройки, Новый СжатиеДанных(9));
	ОбъектНастройкаПрограммы.Записать();
	
КонецФункции

&НаКлиенте
Процедура ИспользоватьКачествоПриИзменении(Элемент)
	УстановитьИспользованиеКачество();
КонецПроцедуры

&НаСервере
Функция УстановитьИспользованиеКачество() 
	
	НастройкаПрограммы = Справочники.вмс_НастройкиПрограммы.ПолучитьНастройкуПрограммы("НастройкаТоварныхПолей");
	СтруктураНастройки = НастройкаПрограммы.ХранилищеНастройки.Получить();
	СтрокаПоля = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(СтруктураНастройки.ТаблицаПолей, Новый Структура("Имя", "Качество"));
	СтрокаПоля.Использование = ИспользоватьКачество; 
	
	ОбъектНастройкаПрограммы = НастройкаПрограммы.ПолучитьОбъект();
	ОбъектНастройкаПрограммы.ХранилищеНастройки = Новый ХранилищеЗначения(СтруктураНастройки, Новый СжатиеДанных(9));
	ОбъектНастройкаПрограммы.Записать();
	
КонецФункции

&НаКлиенте
Процедура Упаковки_ПолучатьКоличествоИзШтрихкодаПриИзменении(Элемент)
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу("Упаковки_УчитыватьКоэффициентУпаковкиШтрихкода", ЭтотОбъект[ИдентификаторНастройки]);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПомещенияПриИзменении(Элемент)
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьABCАнализПриИзменении(Элемент)
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, ЭтотОбъект[ИдентификаторНастройки]);
	
	ЗапуститьABCАнализ();
КонецПроцедуры

&НаКлиенте
Процедура ГраницаГруппыAПриИзменении(Элемент)
	
	Если ГраницаГруппыA < ГраницаГруппыB Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Верхняя граница классификации не может быть меньше нижней!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЗапуститьABCАнализ();
КонецПроцедуры

&НаКлиенте
Процедура ГраницаГруппыBПриИзменении(Элемент)
	Если ГраницаГруппыB > ГраницаГруппыA Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нижняя граница классификации не может быть больше верхней!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЗапуститьABCАнализ();
КонецПроцедуры

&НаКлиенте
Процедура ВГХ_ИспользоватьВесогабаритыПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры 

&НаКлиенте
Процедура ИспользоватьПодпиткуПриИзменении(Элемент)
	
	Если ИспользоватьПодпитку = Ложь Тогда
		РегламентноеЗаданиеВключено = ПолучитьИспользованиеРегламеногоЗаданияПодпитки();     
		Если РегламентноеЗаданиеВключено Тогда   
			ИспользоватьПодпитку = Истина;
			ОО = Новый ОписаниеОповещения("ПодтверждениеОтключенияПодпитки", ЭтотОбъект);	
			ПоказатьВопрос(ОО, "Регламентное задание формирования подпиток будет отключено. Продолжить?", РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	НастроитьДоступностьЭлементовПодпитки();  
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ВвестиЛицензииТСД(Команда)
	ОткрытьФорму("РегистрСведений.вмс_Лицензии.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВвестиЛицензииПодсистем(Команда)
	ОткрытьФорму("РегистрСведений.вмс_ЛицензииПодсистем.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВвестиВидыНоменклатурыСерий(Команда)  
	Отбор = Новый Структура("Схема", вмс_ОперацииПоЯчейкамВызовСервера.СхемаСоединения_ИспользованиеСерий());
	ОткрытьФорму("РегистрСведений.вмс_СоединениеОбъектов.ФормаСписка", Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиРеквизитыСерийПоВидамНоменклатуры(Команда)
	Отбор = Новый Структура("Схема", вмс_ОперацииПоЯчейкамВызовСервера.СхемаСоединения_ВидыНастроекСерий());
	ОткрытьФорму("РегистрСведений.вмс_СоединениеОбъектов.ФормаСписка", Новый Структура("Отбор", Отбор));
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПомещения(Команда)
	ОткрытьФорму("Справочник.вмс_Помещения.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОсвободитьЛицензию(Команда)
	АктивнаяСтрока = Элементы.ЛицензииТСД.ТекущиеДанные;
	ОсвободитьЛицензиюСервер(АктивнаяСтрока.Лицензия, АктивнаяСтрока.ПубличныйКлюч);
	Элементы.ЛицензииТСД.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОсвободитьЛицензиюСервер(Лицензия, ПубличныйКлюч)
	РегистрыСведений.вмс_Лицензии.ОсвободитьЛицензию(Лицензия, ПубличныйКлюч);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЯчейкуБезОстатка(Команда)
	СоздатьЯчейкуБезОстаткаНаСервере();
	ЗаписатьНастройкуПрограммыВБазу("ЯчейкаБезОстатка", ВиртуальнаяЯчейка_БезОстатка);	
КонецПроцедуры 

&НаСервере
Процедура СоздатьЯчейкуБезОстаткаНаСервере()
	
	НоваяЯчейка = Справочники.вмс_МестаХранения.СоздатьЭлемент();
	НоваяЯчейка.Заполнить(Неопределено);
	НоваяЯчейка.Наименование = "Без остатка";
	НоваяЯчейка.ТипЯчейки = Перечисления.вмс_ТипыЯчеек.Карантин;
	НоваяЯчейка.Записать();
	
	ВиртуальнаяЯчейка_БезОстатка = НоваяЯчейка.Ссылка;
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	УстановитьИспользованиеХарактеристик();
	УстановитьНастройкиВесогабариты();   
	УстановитьНастройкиПодпитки(ИспользоватьПодпитку);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеПодпитки(Команда)   
	
	Гуид = ПолучитьГуидРегламентногоЗаданияПодпитки(); 
	ПараметрыФормы = Новый Структура("Идентификатор, Действие",Гуид, "Изменить"); 
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", ПараметрыФормы);    
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаписатьНастройкуПрограммыВБазу(ИдентификаторНастройки, Значение)
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы(ИдентификаторНастройки, Значение);
КонецФункции

&НаСервере
Функция ЗапроситьКоличествоЛицензийТСД()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_Лицензии.Лицензия КАК Лицензия
	|ИЗ
	|	РегистрСведений.вмс_Лицензии КАК вмс_Лицензии";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоЛицензийТСД = Выборка.Количество();
	
КонецФункции

&НаСервере
Функция ЗапроситьКоличествоЛицензийПодсистем()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_ЛицензииПодсистем.Лицензия КАК Лицензия
	|ИЗ
	|	РегистрСведений.вмс_ЛицензииПодсистем КАК вмс_ЛицензииПодсистем
	|ГДЕ
	|	вмс_ЛицензииПодсистем.Лицензия <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоЛицензийПодсистем = Выборка.Количество();
	
КонецФункции

&НаСервере
Функция ОбновитьЗаголовокКоличествоЛицензий()
	
	Элементы.ВвестиЛицензииТСД.Заголовок = СтрШаблон("Ввести лицензии ТСД (%2)", Элементы.ВвестиЛицензииТСД.Заголовок, КоличествоЛицензийТСД);
	Элементы.ВвестиЛицензииПодсистем.Заголовок = СтрШаблон("Ввести лицензии подсистем (%2)", Элементы.ВвестиЛицензииПодсистем.Заголовок, КоличествоЛицензийПодсистем);
	
КонецФункции

&НаСервере
Функция ЗаполнитьНастройкиМодуля()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_НастройкиПрограммы.Имя КАК Имя,
	|	вмс_НастройкиПрограммы.Значение КАК Значение
	|ИЗ
	|	Справочник.вмс_НастройкиПрограммы КАК вмс_НастройкиПрограммы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ЭтотОбъект[Выборка.Имя] = Выборка.Значение;
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;
		
		Если Выборка.Имя = "ЯчейкаБезОстатка" Тогда
			ВиртуальнаяЯчейка_БезОстатка = Выборка.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	ИспользоватьХарактеристики = вмс_АдаптацияКонфигураций.ИспользуютсяХарактеристики();
	ИспользоватьСерии = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля().Найти("Серия") <> Неопределено;
	ИспользоватьКачество = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля().Найти("Качество") <> Неопределено;
	
КонецФункции

&НаСервере
Функция УстановитьДоступностьЭлементов() 
	
	// весогабариты
	//Элементы.ВГХ_НастройкаПриоритетов.ТолькоПросмотр = НЕ ВГХ_ИспользоватьВесогабариты;
	//Элементы.ВГХ_ПравилоОпределенияМонотоварности.ТолькоПросмотр = НЕ ВГХ_ИспользоватьВесогабариты;
	Элементы.ВГХ_Монотоварность_Характеристика.ТолькоПросмотр = НЕ ИспользоватьХарактеристики;   
	
	// лкп_2
	Элементы.НастройкиЛКП_2.ТолькоПросмотр = НЕ ОтображениеЛК;
	
	//// настройки учета
	Элементы.ИспользоватьСерии_Настройки.Доступность = ИспользоватьСерии;
	Элементы.ИспользоватьПомещения_Настройки.Доступность = ИспользоватьПомещения;
	Элементы.СоздатьЯчейкуБезОстатка.Доступность = ЗначениеЗаполнено(ВиртуальнаяЯчейка_БезОстатка) = Ложь;
	
	Элементы.ГруппаГраницыГрупп.Доступность = ИспользоватьABCАнализ; 
	
	Элементы.НастроитьРасписаниеПодпитки.Доступность = ИспользоватьПодпитку;
	
КонецФункции

&НаСервере
Функция УстановитьНастройкиВесогабариты()
	
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ВГХ_ИспользоватьВесогабариты", ВГХ_ИспользоватьВесогабариты);
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ВГХ_Приоритет_Смешанные", ВГХ_Приоритет_Смешанные);
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ВГХ_Приоритет_Монотовары", ВГХ_Приоритет_Монотовары);
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ВГХ_Приоритет_Пустые", ВГХ_Приоритет_Пустые);
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ВГХ_Приоритет_Прочие", ВГХ_Приоритет_Прочие);
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ВГХ_Приоритет_Исторические", ВГХ_Приоритет_Исторические);
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ВГХ_Приоритет_Статические", ВГХ_Приоритет_Статические);
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ВГХ_Монотоварность_Товар", ВГХ_Монотоварность_Товар);
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ВГХ_Монотоварность_Характеристика", ВГХ_Монотоварность_Товар И ВГХ_Монотоварность_Характеристика);
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ВГХ_Монотоварность_Серия", ВГХ_Монотоварность_Серия);
	
КонецФункции

&НаСервере
Функция ПрочитатьНастройкиВесогабариты() 
	
	НастройкиРазмещения = вмс_РазмещениеСервер.НастройкиРазмещения();
	ВГХ_ИспользоватьВесогабариты = НастройкиРазмещения.ИспользоватьВГХ;
	ВГХ_Приоритет_Смешанные = НастройкиРазмещения.ПриоритетДляСмешанныхЯчеек;
	ВГХ_Приоритет_Монотовары = НастройкиРазмещения.ПриоритетДляМонотоварныхЯчеек;
	ВГХ_Приоритет_Пустые = НастройкиРазмещения.ПриоритетДляПустыхЯчеек;
	ВГХ_Приоритет_Прочие = НастройкиРазмещения.ПриоритетДляПрочихЯчеек;
	ВГХ_Приоритет_Исторические = НастройкиРазмещения.ПриоритетДляИсторическихЯчеек;
	ВГХ_Приоритет_Статические = НастройкиРазмещения.ПриоритетДляСтатическихЯчеек;
	ВГХ_Монотоварность_Товар = НастройкиРазмещения.МонотоварностьПоТовару;
	ВГХ_Монотоварность_Характеристика = НастройкиРазмещения.МонотоварностьПоТоваруХарактеристике;
	ВГХ_Монотоварность_Серия = НастройкиРазмещения.МонотоварностьПоСерии;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикКомандыУстановитьКомпонентуСетевойПечати(Команда)  
	
	Если УстановитьКомпонентуСетевойПечатиНаСервере() Тогда
		ПоказатьПредупреждение(, "Компонента установлена!");
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция УстановитьКомпонентуСетевойПечатиНаСервере()
	
	Возврат УстановитьКомпонентуСетевойПечати(ЭтаФорма);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьКомпонентуСетевойПечати(Форма)
	
	вмс_ПечатьКлиентСервер.УстановитьКомпонентуСетевойПечати();
	
	Возврат ПроверкаКомпонентыСетевойПечати(Форма);
	
КонецФункции

&НаСервере
Процедура ПроверкаКомпонентыСетевойПечатиНаСервере()
	
	ПроверкаКомпонентыСетевойПечати(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПроверкаКомпонентыСетевойПечати(Форма)
	
	ПутьКФайлуПоУмолчанию = вмс_ПечатьКлиентСервер.ПолучитьПутьКФайлуКомпонентуСетевойПечатиПоУмолчанию();
	
	УстановленныйФайл = Новый Файл(ПутьКФайлуПоУмолчанию);
	КомпонентаУстановлена = УстановленныйФайл.Существует();
	
	Если КомпонентаУстановлена Тогда
		Форма.Элементы.КомпонентаСетевойПечати_Статус.Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
		Форма.ПутьКомпонентыСетевойПечати = ПутьКФайлуПоУмолчанию;
		Возврат Истина;
	Иначе
		Форма.Элементы.КомпонентаСетевойПечати_Статус.Картинка = БиблиотекаКартинок.ОформлениеЗнакКрест;
		Форма.ПутьКомпонентыСетевойПечати = "";	
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗапуститьABCАнализ()
	Если ЗначениеЗаполнено(ИспользоватьABCАнализ) И ЗначениеЗаполнено(ГраницаГруппыA) И ЗначениеЗаполнено(ГраницаГруппыB) Тогда
		вмс_ПолучениеДанныхABCАнализаСервер.ЗапуститьABCАнализ(ИспользоватьABCАнализ, ГраницаГруппыA, ГраницаГруппыB);	
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьИспользованиеРегламеногоЗаданияПодпитки() 
		
	МенеджерНастроек = Справочники.вмс_НастройкиПрограммы; 
	ГуидРегламентногоЗаданияСтрокой = СокрЛП(МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("Подпитка_ГуидРегламентногоЗадания")); 
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ГуидРегламентногоЗаданияСтрокой));
	Возврат РегламентноеЗадание.Использование;
			
КонецФункции

&НаСервере
Процедура НастроитьДоступностьЭлементовПодпитки()  
	
	Если ИспользоватьПодпитку Тогда
		Элементы.НастроитьРасписаниеПодпитки.Доступность = Истина;
	Иначе
		Элементы.НастроитьРасписаниеПодпитки.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеОтключенияПодпитки(Результат, ДополнительныеПараметры = Неопределено) Экспорт    
	
	Если Результат = КодВозвратаДиалога.Да Тогда      
		ИспользоватьПодпитку = Ложь; 
		ОтключитьИспользованиеРегламентногоЗаданияПодпитки();
		НастроитьДоступностьЭлементовПодпитки();	  
		УстановитьНастройкиПодпитки(ИспользоватьПодпитку);
	КонецЕсли;
	
КонецПроцедуры     

&НаСервере
Процедура ОтключитьИспользованиеРегламентногоЗаданияПодпитки()    
	 
	МенеджерНастроек = Справочники.вмс_НастройкиПрограммы; 
	ГуидРегламентногоЗаданияСтрокой = СокрЛП(МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("Подпитка_ГуидРегламентногоЗадания")); 
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ГуидРегламентногоЗаданияСтрокой)); 
	РегламентноеЗадание.Использование = Ложь;
	РегламентноеЗадание.Записать();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьНастройкиПодпитки(СостояниеПодпитки)    
	
	Справочники.вмс_НастройкиПрограммы.ЗаписатьНастройкуПрограммы("ИспользоватьПодпитку", СостояниеПодпитки);
		
КонецПроцедуры

&НаСервере
Функция ПолучитьГуидРегламентногоЗаданияПодпитки()
	
	МенеджерНастроек = Справочники.вмс_НастройкиПрограммы; 
	ГуидРегламентногоЗаданияСтрокой = СокрЛП(МенеджерНастроек.ПолучитьЗначениеНастройкиПрограммы("Подпитка_ГуидРегламентногоЗадания"));   
	
	Если СтрДлина(ГуидРегламентногоЗаданияСтрокой) > 0 Тогда
		ГуидРегламентногоЗадания = Новый УникальныйИдентификатор(ГуидРегламентногоЗаданияСтрокой); 	
		Возврат ГуидРегламентногоЗадания;
	КонецЕсли;
	
	МетаданныеЗадания = Метаданные.РегламентныеЗадания.вмс_ВыполнятьПодпиткуЯчеекОтбора;
	РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеЗадания);  
	РегламентноеЗадание.Наименование = "Подпитка ячеек отбора (вмс)";
	РегламентноеЗадание.Ключ = "ПодпиткаЯчеекОтбораВмс"; 
	РегламентноеЗадание.Использование = Ложь;  
	РегламентноеЗадание.Записать(); 
	
	ГуидРегламентногоЗаданияПодпитки = Строка(РегламентноеЗадание.УникальныйИдентификатор);
	МенеджерНастроек.ЗаписатьНастройкуПрограммы("Подпитка_ГуидРегламентногоЗадания", ГуидРегламентногоЗаданияПодпитки); 
	
	Возврат РегламентноеЗадание.УникальныйИдентификатор;        
	
КонецФункции

// ТУ_Васильев 06.11.25 ++
	

&НаКлиенте
Процедура Упаковки_ВестиУчетОстатковПоУпаковкамПриИзменении(Элемент)
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу("Упаковки_ВестиУчетОстатковПоУпаковкам", ЭтотОбъект[ИдентификаторНастройки]);
КонецПроцедуры

&НаКлиенте
Процедура Упаковки_ПланироватьОтборПоУпаковкамПриИзменении(Элемент)
	ИдентификаторНастройки = Элемент.Имя;
	ЗаписатьНастройкуПрограммыВБазу("Упаковки_ПланироватьОтборПоУпаковкам", ЭтотОбъект[ИдентификаторНастройки]);
КонецПроцедуры

// ТУ_Васильев 06.11.25 --


#КонецОбласти
